[
  {
    "bookId": "1",
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co.com/9V1vRC0/To-Kill-a-Mockingbird-many-1961.png",
    "review": "This classic novel explores themes of racial injustice and moral growth. Through the eyes of Scout Finch, readers experience life in a small Southern town where prejudices run deep. Harper Lee's writing creates a vivid setting and memorable characters, especially the unforgettable Atticus Finch, who stands as a beacon of integrity and justice. It is a story of innocence lost and humanity found, and its impact resonates with readers decades after its publication.",
    "totalPages": 281,
    "rating": 4.8,
    "category": "Fiction",
    "tags": ["Classic", "Social Justice", "Coming of Age"],
    "publisher": "J.B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },

  {
    "bookId": "2",
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co.com/Qc8R6cw/pride-and-prejudice.jpg",
    "review": "This timeless romance by Jane Austen follows Elizabeth Bennet and Mr. Darcy as they navigate social expectations, misunderstandings, and their own pride. Set in early 19th-century England, 'Pride and Prejudice' showcases Austen's wit and keen observations about love, class, and societal norms. The characters are richly developed, and the story is both delightful and profound. Austen's novel has remained popular for its charm, humor, and sharp insights into human nature.",
    "totalPages": 279,
    "rating": 4.9,
    "category": "Romance",
    "tags": ["Classic", "Romance", "Social Commentary"],
    "publisher": "T. Egerton",
    "yearOfPublishing": 1813
  },
  {
    "bookId": "3",
    "bookName": "The Lord of the Rings",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co.com/vx2CZYM/The-Lord-of-the-Rings.jpg",
    "review": "J.R.R. Tolkien's epic fantasy trilogy, 'The Lord of the Rings,' is a journey through Middle-earth, where hobbits, elves, and men battle the forces of darkness. The story of the One Ring and its ability to corrupt is thrilling, filled with unforgettable characters like Frodo, Gandalf, and Aragorn. Tolkien’s rich world-building and linguistic creativity make this a must-read for fantasy fans. It’s a saga of friendship, courage, and the struggle between good and evil.",
    "totalPages": 1216,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Adventure", "Epic Fantasy", "Friendship"],
    "publisher": "George Allen & Unwin",
    "yearOfPublishing": 1954
  },
  {
    "bookId": "4",
    "bookName": "Harry Potter",
    "author": "J.K. Rowling",
    "image": "https://i.ibb.co.com/BZ6MLnn/harry-potter.jpg",
    "review": "The first book in J.K. Rowling's Harry Potter series introduces readers to a magical world where young Harry discovers he’s a wizard. Attending Hogwarts School of Witchcraft and Wizardry, he finds friendship and uncovers secrets about his past. This enchanting tale is filled with magic, suspense, and adventure, making it a global favorite. Rowling’s storytelling and character creation appeal to readers of all ages, establishing Harry Potter as a beloved cultural phenomenon.",
    "totalPages": 309,
    "rating": 4.8,
    "category": "Fantasy",
    "tags": ["Adventure", "Magic", "Friendship"],
    "publisher": "Bloomsbury",
    "yearOfPublishing": 1997
  },
  {
    "bookId": "5",
    "bookName": "The Da Vinci Code",
    "author": "Dan Brown",
    "image": "https://i.ibb.co.com/Yp2JY4j/The-Da-Vinci-Code.jpg",
    "review": "This fast-paced thriller by Dan Brown blends art, history, and religion as symbologist Robert Langdon unravels a mystery hidden within famous works of art. Set against the backdrop of Paris and London, 'The Da Vinci Code' is an exhilarating mix of puzzles, conspiracies, and action. Brown's research and intricate plot keep readers engaged, making it both an intellectual and thrilling read. A masterpiece of suspense that has captivated millions.",
    "totalPages": 489,
    "rating": 4.5,
    "category": "Mystery",
    "tags": ["Suspense", "Religion", "Art"],
    "publisher": "Doubleday",
    "yearOfPublishing": 2003
  },
  {
    "bookId": "6",
    "bookName": "The Girl on the Train",
    "author": "Paula Hawkins",
    "image": "https://i.ibb.co.com/Hq9D222/The-Girl-on-the-Train.jpg",
    "review": "This psychological thriller follows Rachel, a troubled woman who becomes entangled in a missing persons case. Paula Hawkins crafts a suspenseful story filled with twists and unreliable narrators. The book explores themes of memory, obsession, and deception, leaving readers questioning reality. With complex characters and a dark atmosphere, 'The Girl on the Train' is a page-turner that keeps you guessing until the final reveal.",
    "totalPages": 316,
    "rating": 4.1,
    "category": "Thriller",
    "tags": ["Suspense", "Psychological", "Mystery"],
    "publisher": "Riverhead Books",
    "yearOfPublishing": 2015
  },
  {
    "bookId": "7",
    "bookName": "The Book Thief",
    "author": "Markus Zusak",
    "image": "https://i.ibb.co.com/FKg5VWK/the-book-thief.jpg",
    "review": "Narrated by Death, 'The Book Thief' follows Liesel, a young girl in Nazi Germany who discovers the power of words. Zusak’s poignant storytelling and unique perspective create a hauntingly beautiful novel that explores human resilience, friendship, and love during one of history's darkest times. It’s a novel that resonates deeply, capturing the impact of literature and the bonds formed in times of suffering.",
    "totalPages": 552,
    "rating": 4.8,
    "category": "Historical Fiction",
    "tags": ["War", "Friendship", "Literature"],
    "publisher": "Picador",
    "yearOfPublishing": 2005
  },
  {
    "bookId": "8",
    "bookName": "The Kite Runner",
    "author": "Khaled Hosseini",
    "image": "https://i.ibb.co.com/yRX7kbJ/The-Kite-Runner.png",
    "review": "Set in Afghanistan, 'The Kite Runner' tells the story of Amir and Hassan, whose friendship is tested by betrayal and societal pressures. Hosseini’s narrative captures the complexities of guilt, redemption, and forgiveness. Through vivid descriptions and emotional depth, the novel provides insight into Afghan culture and the impacts of war. It’s a powerful story of love and loyalty, resonating with readers worldwide.",
    "totalPages": 371,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Friendship", "Redemption", "Cultural"],
    "publisher": "Riverhead Books",
    "yearOfPublishing": 2003
  },
  {
    "bookId": "9",
    "bookName": "A Game of Thrones",
    "author": "George R.R. Martin",
    "image": "https://i.ibb.co.com/JBHNTv8/A-Game-of-Thrones.jpg",
    "review": "The first book in the 'A Song of Ice and Fire' series, 'A Game of Thrones' is an epic tale of power struggles, betrayals, and alliances. Martin creates a sprawling fantasy world with complex characters and intricate plotlines. Known for its unpredictability, the novel is a gritty and realistic portrayal of medieval politics. Martin's storytelling keeps readers captivated in a world where no character is safe.",
    "totalPages": 694,
    "rating": 4.6,
    "category": "Fantasy",
    "tags": ["Epic", "Politics", "Adventure"],
    "publisher": "Bantam Books",
    "yearOfPublishing": 1996
  },
  {
    "bookId": "10",
    "bookName": "The Road",
    "author": "Cormac McCarthy",
    "image": "https://i.ibb.co.com/1vNb0VK/The-Road.jpg",
    "review": "McCarthy's 'The Road' is a harrowing story of a father and son's journey through a post-apocalyptic landscape. The sparse, poetic prose and bleak setting create an atmosphere of dread and despair. The novel explores themes of survival, hope, and love in the face of overwhelming darkness. McCarthy’s work is haunting and deeply affecting, resonating with readers who appreciate thought-provoking and emotionally charged storytelling.",
    "totalPages": 287,
    "rating": 4.4,
    "category": "Post-apocalyptic",
    "tags": ["Survival", "Dystopia", "Family"],
    "publisher": "Alfred A. Knopf",
    "yearOfPublishing": 2006
  },
  {
    "bookId": "11",
    "bookName": "Gone Girl",
    "author": "Gillian Flynn",
    "image": "https://i.ibb.co.com/rtJJKTN/Gone-Girl.jpg",
    "review": "In 'Gone Girl,' Gillian Flynn crafts a dark, twisted tale of marriage, betrayal, and manipulation. When Amy Dunne goes missing, suspicions fall on her husband Nick, revealing secrets and lies that change the story with every turn. Flynn's complex characters and shocking plot twists keep readers engaged until the end. It’s a psychological thriller that explores the darker sides of human relationships.",
    "totalPages": 422,
    "rating": 4.3,
    "category": "Thriller",
    "tags": ["Suspense", "Psychological", "Mystery"],
    "publisher": "Crown Publishing Group",
    "yearOfPublishing": 2012
  },
  {
    "bookId": "12",
    "bookName": "Sapiens: A Brief History of Humankind",
    "author": "Yuval Noah Harari",
    "image": "https://i.ibb.co.com/Qvnqf6W/Sapiens-A-Brief-History-of-Humankind.jpg",
    "review": "Harari’s 'Sapiens' explores the history of humankind from the Stone Age to the modern era. With clarity and depth, he examines human evolution, society, and the forces that have shaped civilization. The book provides insights into biology, anthropology, and history, presenting complex ideas in an accessible way. 'Sapiens' is thought-provoking and challenges readers to consider humanity’s future.",
    "totalPages": 443,
    "rating": 4.7,
    "category": "Non-fiction",
    "tags": ["History", "Evolution", "Society"],
    "publisher": "Harper",
    "yearOfPublishing": 2014
  },
  {
    "bookId": "13",
    "bookName": "The Silent Patient",
    "author": "Alex Michaelides",
    "image": "https://i.ibb.co.com/S3GyvnL/The-Silent-Patient.jpg",
    "review": "This psychological thriller follows Alicia Berenson, who is accused of murdering her husband and subsequently stops speaking. Her therapist, Theo, is determined to uncover the truth behind her silence. Michaelides crafts a gripping narrative with suspense and dark psychological twists. 'The Silent Patient' delves into themes of trauma, obsession, and mental health, making it a page-turner that keeps readers guessing.",
    "totalPages": 323,
    "rating": 4.2,
    "category": "Thriller",
    "tags": ["Psychological", "Mystery", "Trauma"],
    "publisher": "Celadon Books",
    "yearOfPublishing": 2019
  },
  {
    "bookId": "14",
    "bookName": "Educated",
    "author": "Tara Westover",
    "image": "https://i.ibb.co.com/XZWwQXQ/Educated.jpg",
    "review": "Tara Westover's memoir, 'Educated,' tells her inspiring journey from growing up in a strict, survivalist family in rural Idaho to earning a PhD from Cambridge University. The book explores themes of family loyalty, personal growth, and the transformative power of education. Her writing is honest and gripping, shedding light on the challenges she faced as she navigated a world beyond her upbringing. It's a powerful and uplifting story of resilience.",
    "totalPages": 334,
    "rating": 4.7,
    "category": "Memoir",
    "tags": ["Inspiration", "Family", "Education"],
    "publisher": "Random House",
    "yearOfPublishing": 2018
  },
  {
    "bookId": "15",
    "bookName": "Where the Crawdads Sing",
    "author": "Delia Owens",
    "image": "https://i.ibb.co.com/q1Vr8kh/where-the-crawdads-sing.jpg",
    "review": "Delia Owens’ novel is a hauntingly beautiful tale of Kya, a girl who grows up alone in the marshes of North Carolina. Combining elements of mystery and romance, the story explores themes of loneliness, resilience, and the wonders of the natural world. Owens’ descriptive prose creates a vivid setting, and the plot unfolds with unexpected twists. It’s an emotional journey that resonates with readers long after the final page.",
    "totalPages": 368,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Nature", "Mystery", "Romance"],
    "publisher": "G.P. Putnam's Sons",
    "yearOfPublishing": 2018
  },
  {
    "bookId": "16",
    "bookName": "The Power of Now",
    "author": "Eckhart Tolle",
    "image": "https://i.ibb.co.com/YjkGJF6/The-Power-of-Now.jpg",
    "review": "Eckhart Tolle’s 'The Power of Now' is a transformative guide to living in the present moment. Blending philosophy and spirituality, Tolle offers insights on overcoming the mind’s attachment to the past and future. His teachings are simple yet profound, encouraging readers to find peace and purpose by embracing the now. It’s a life-changing read that has inspired millions to lead more mindful, peaceful lives.",
    "totalPages": 229,
    "rating": 4.5,
    "category": "Self-help",
    "tags": ["Mindfulness", "Spirituality", "Personal Growth"],
    "publisher": "New World Library",
    "yearOfPublishing": 1997
  },
  {
    "bookId": "17",
    "bookName": "Little Fires Everywhere",
    "author": "Celeste Ng",
    "image": "https://i.ibb.co.com/bPnknNZ/Little-Fires-Everywhere.jpg",
    "review": "Celeste Ng’s 'Little Fires Everywhere' is a thought-provoking exploration of race, privilege, and family dynamics set in the suburb of Shaker Heights. The story follows two families whose lives become intertwined in unexpected ways. Ng’s writing is nuanced, examining complex social issues through relatable characters. The novel is engaging and profound, leaving readers questioning societal norms and the meaning of belonging.",
    "totalPages": 338,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["Family", "Society", "Identity"],
    "publisher": "Penguin Press",
    "yearOfPublishing": 2017
  },
  {
    "bookId": "18",
    "bookName": "The Subtle Art of Not Giving a F*ck",
    "author": "Mark Manson",
    "image": "https://i.ibb.co.com/qsrgPWY/The-Subtle-Art-of-Not-Giving-a-Fck.jpg",
    "review": "Mark Manson’s 'The Subtle Art of Not Giving a F*ck' challenges conventional wisdom on happiness and success. With humor and blunt honesty, Manson encourages readers to embrace limitations and redefine what truly matters. His approach to self-improvement is refreshing and grounded, making this book both practical and thought-provoking. It’s a modern guide to letting go of unnecessary worries and focusing on what counts.",
    "totalPages": 224,
    "rating": 4.2,
    "category": "Self-help",
    "tags": ["Personal Growth", "Mindset", "Happiness"],
    "publisher": "HarperOne",
    "yearOfPublishing": 2016
  }
 
]
